RT-Thread/rt-thread/bsp/n32g45x/Libraries/n32g45x_std_periph_driver/n32g45x_std_driver/inc/n32g45x_eth.h
    uint32_t PassCtrlFrames; /*!< Sets the forwarding mode of the control frames (including unicast and multicast Pause
                                frames) This parameter can be a value of @ref ETH_Pass_Control_Frames */

    uint32_t BroadcastFramesReception; /*!< Selects or not the reception of Broadcast Frames
                                              This parameter can be a value of @ref ETH_Broadcast_Frames_Reception */

    uint32_t DestAddrFilter; /*!< Sets the destination filter mode for both unicast and multicast frames
                                           This parameter can be a value of @ref ETH_Destination_Addr_Filter */

    uint32_t PromiscuousMode; /*!< Selects or not the Promiscuous Mode
                                     This parameter can be a value of @ref ETH_Promiscuous_Mode */

    uint32_t MulticastFramesFilter; /*!< Selects the Multicast Frames filter mode:
                                       None/HashTableFilter/PerfectFilter/PerfectHashTableFilter
                                           This parameter can be a value of @ref ETH_Multicast_Frames_Filter */

    uint32_t UnicastFramesFilter; /*!< Selects the Unicast Frames filter mode:
                                     HashTableFilter/PerfectFilter/PerfectHashTableFilter
                                         This parameter can be a value of @ref ETH_Unicast_Frames_Filter */

    uint32_t HashTableHigh; /*!< This field holds the higher 32 bits of Hash table.  */

    uint32_t HashTableLow; /*!< This field holds the lower 32 bits of Hash table.  */

    uint32_t PauseTime; /*!< This field holds the value to be used in the Pause Time field in the
                               transmit control frame */

    uint32_t ZeroQuantaPause; /*!< Selects or not the automatic generation of Zero-Quanta Pause Control frames
                                     This parameter can be a value of @ref ETH_Zero_Quanta_Pause */

    uint32_t PauseLowThreshold; /*!< This field configures the threshold of the Pause to be checked for
                                       automatic retransmission of Pause Frame
                                       This parameter can be a value of @ref ETH_Pause_Low_Threshold */

    uint32_t UnicastPauseFrameDetect; /*!< Selects or not the MAC detection of the Pause frames (with MAC Address0
                                             unicast address and unique multicast address)
                                             This parameter can be a value of @ref ETH_Unicast_Pause_Frame_Detect */

    uint32_t RxFlowCtrl; /*!< Enables or disables the MAC to decode the received Pause frame and
                                        disable its transmitter for a specified time (Pause Time)
                                        This parameter can be a value of @ref ETH_Receive_Flow_Control */

    uint32_t TxFlowCtrl; /*!< Enables or disables the MAC to transmit Pause frames (Full-Duplex mode)
                                         or the MAC back-pressure operation (Half-Duplex mode)
                                         This parameter can be a value of @ref ETH_Transmit_Flow_Control */

    uint32_t VLANTagComparison; /*!< Selects the 12-bit VLAN identifier or the complete 16-bit VLAN tag for
                                       comparison and filtering
                                       This parameter can be a value of @ref ETH_VLAN_Tag_Comparison */

    uint32_t VLANTagIdentifier; /*!< Holds the VLAN tag identifier for receive frames */

    uint32_t DropTCPIPChecksumErrorFrame; /*!< Selects or not the Dropping of TCP/IP Checksum Error Frames
                                                 This parameter can be a value of @ref
                                             ETH_Drop_TCP_IP_Checksum_Error_Frame */

    uint32_t RxStoreForward; /*!< Enables or disables the Receive store and forward mode
                                         This parameter can be a value of @ref ETH_Receive_Store_Forward */

    uint32_t FlushRxFrame; /*!< Enables or disables the flushing of received frames
                                        This parameter can be a value of @ref ETH_Flush_Received_Frame */

    uint32_t TxStoreForward; /*!< Enables or disables Transmit store and forward mode
                                          This parameter can be a value of @ref ETH_Transmit_Store_Forward */

    uint32_t TxThresholdCtrl; /*!< Selects or not the Transmit Threshold Control
                                              This parameter can be a value of @ref ETH_Transmit_Threshold_Control */

    uint32_t ForwardErrorFrames; /*!< Selects or not the forward to the DMA of erroneous frames
                                        This parameter can be a value of @ref ETH_Forward_Error_Frames */

    uint32_t ForwardUndersizedGoodFrames; /*!< Enables or disables the Rx DATFIFO to forward Undersized frames (frames
                                             with no Error and length less than 64 bytes) including pad-bytes and CRC)
                                                 This parameter can be a value of @ref
                                             ETH_Forward_Undersized_Good_Frames */

    uint32_t RxThresholdCtrl; /*!< Selects the threshold level of the Receive DATFIFO
                                             This parameter can be a value of @ref ETH_Receive_Threshold_Control */

    uint32_t SecondFrameOperate; /*!< Selects or not the Operate on second frame mode, which allows the DMA to process a
                                    second frame of Transmit data even before obtaining the status for the first frame.
                                        This parameter can be a value of @ref ETH_Second_Frame_Operate */

    uint32_t AddrAlignedBeats; /*!< Enables or disables the Address Aligned Beats
                                         This parameter can be a value of @ref ETH_Address_Aligned_Beats */

    uint32_t FixedBurst; /*!< Enables or disables the AHB Master interface fixed burst transfers
                                This parameter can be a value of @ref ETH_Fixed_Burst */

    uint32_t RxDMABurstLen; /*!< Indicates the maximum number of beats to be transferred in one Rx DMA transaction
                                      This parameter can be a value of @ref ETH_Rx_DMA_Burst_Length */

    uint32_t TxDMABurstLen; /*!< Indicates sthe maximum number of beats to be transferred in one Tx DMA transaction
                                      This parameter can be a value of @ref ETH_Tx_DMA_Burst_Length */

    uint32_t DescSkipLen; /*!< Specifies the number of word to skip between two unchained descriptors (Ring mode) */

    uint32_t DMAArbitration; /*!< Selects the DMA Tx/Rx arbitration
                                    This parameter can be a value of @ref ETH_DMA_Arbitration */
} ETH_InitType;

/**
 * @brief  ETH DMA Desciptors data structure definition
 */
typedef struct
{
    uint32_t Status;             /*!< Status */
    uint32_t CtrlOrBufSize;      /*!< Control and Buffer1, Buffer2 lengths */
    uint32_t Buf1Addr;           /*!< Buffer1 address pointer */
    uint32_t Buf2OrNextDescAddr; /*!< Buffer2 or next descriptor address pointer */
} ETH_DMADescType;

/**
 * @}
 */

/** @addtogroup ETH_Exported_Constants
 * @{
 */

/**
 * @addtogroup ETH_PHY_Registers
 * @{
 */
#define PHY_BCR 0 /*!< Tranceiver Basic Control Register */
#define PHY_BSR 1 /*!< Tranceiver Basic Status Register */

