RT-Thread/rt-thread/bsp/n32g45x/Libraries/n32g45x_std_periph_driver/n32g45x_std_driver/inc/n32g45x_eth.h
#define IS_ETH_PTP_SUBSECOND_INCREMENT(SUBSECOND) ((SUBSECOND) <= 0xFF)

/**
 * @}
 */

/** @addtogroup ETH_PTP_time_sign
 * @{
 */
#define ETH_PTP_POSITIVE_TIME      ((uint32_t)0x00000000) /*!< Positive time value */
#define ETH_PTP_NEGATIVE_TIME      ((uint32_t)0x80000000) /*!< Negative time value */
#define IS_ETH_PTP_TIME_SIGN(SIGN) (((SIGN) == ETH_PTP_POSITIVE_TIME) || ((SIGN) == ETH_PTP_NEGATIVE_TIME))

#define IS_ETH_PTP_TIME_STAMP_UPDATE_SUBSECOND(SUBSECOND) ((SUBSECOND) <= 0x7FFFFFFF)

#define ETH_PTPTSCTRL ((uint32_t)0x00000700) /*!< PTP TSCR register */
#define ETH_PTPSSINC  ((uint32_t)0x00000704) /*!< PTP SSIR register */
#define ETH_PTPSEC    ((uint32_t)0x00000708) /*!< PTP TSHR register */
#define ETH_PTPNS     ((uint32_t)0x0000070C) /*!< PTP TSLR register */
#define ETH_PTPSECUP  ((uint32_t)0x00000710) /*!< PTP TSHUR register */
#define ETH_PTPNSUP   ((uint32_t)0x00000714) /*!< PTP TSLUR register */
#define ETH_PTPTSADD  ((uint32_t)0x00000718) /*!< PTP TSAR register */
#define ETH_PTPTTSEC  ((uint32_t)0x0000071C) /*!< PTP TTHR register */
#define ETH_PTPTTNS   ((uint32_t)0x00000720) /* PTP TTLR register */
#define IS_ETH_PTP_REGISTER(REG)                                                                                       \
    (((REG) == ETH_PTPTSCTRL) || ((REG) == ETH_PTPSSINC) || ((REG) == ETH_PTPSEC) || ((REG) == ETH_PTPNS)              \
     || ((REG) == ETH_PTPSECUP) || ((REG) == ETH_PTPNSUP) || ((REG) == ETH_PTPTSADD) || ((REG) == ETH_PTPTTSEC)        \
     || ((REG) == ETH_PTPTTNS))

/**
 * @}
 */

/**
 * @}
 */
/** @addtogroup ETH_Exported_Macros
 * @{
 */
/**
 * @}
 */

/* ETHERNET errors */
#define ETH_ERROR   ((uint32_t)0)
#define ETH_SUCCESS ((uint32_t)1)

/**
 * @brief the function prototype of initialize PHY.
 * @param ETH_InitStruct init struct of ETH MAC peripheral.
 * @return whether initialization succeed:
 *  - ETH_ERROR initialization fail
 *  - ETH_SUCCESS initialization succeed
 */
typedef uint32_t (*ETH_InitPHY)(ETH_InitType* ETH_InitStruct);

/** @addtogroup ETH_Exported_Functions
 * @{
 */
void ETH_DeInit(void);

uint32_t ETH_Init(ETH_InitType* ETH_InitStruct, ETH_InitPHY callable);
void ETH_InitStruct(ETH_InitType* ETH_InitStruct);
void ETH_SoftwareReset(void);
FlagStatus ETH_GetSoftwareResetStatus(void);
void ETH_EnableTxRx(void);
uint32_t ETH_TxPacket(u8* ppkt, u16 FrameLength);
uint32_t ETH_RxPacket(u8* ppkt, uint8_t checkErr);
uint32_t ETH_GetRxPacketSize(void);
void ETH_DropRxPacket(void);

#define ETH_INTERFACE_RMII 0
#define ETH_INTERFACE_MII  1

void ETH_ConfigGpio(uint8_t ETH_Interface, uint8_t remap);

/* PHY */
uint16_t ETH_ReadPhyRegister(u16 PHYAddress, u16 PHYReg);
uint32_t ETH_WritePhyRegister(u16 PHYAddress, u16 PHYReg, u16 PHYValue);
uint32_t ETH_EnablePhyLoopBack(u16 PHYAddress, FunctionalState Cmd);

/* MAC */
void ETH_EnableMacTx(FunctionalState Cmd);
void ETH_EnableMacRx(FunctionalState Cmd);
FlagStatus ETH_GetFlowCtrlBusyStatus(void);
void ETH_GeneratePauseCtrlFrame(void);
void ETH_EnableBackPressureActivation(FunctionalState Cmd);
FlagStatus ETH_GetMacFlagStatus(uint32_t ETH_MAC_FLAG);
INTStatus ETH_GetMacIntStatus(uint32_t ETH_MAC_IT);
void ETH_EnableMacInt(uint32_t ETH_MAC_IT, FunctionalState Cmd);
void ETH_SetMacAddr(uint32_t MacAddr, u8* Addr);
void ETH_GetMacAddr(uint32_t MacAddr, u8* Addr);
void ETH_EnableMacAddrPerfectFilter(uint32_t MacAddr, FunctionalState Cmd);
void ETH_ConfigMacAddrFilter(uint32_t MacAddr, uint32_t Filter);
void ETH_ConfigMacAddrMaskBytesFilter(uint32_t MacAddr, uint32_t MaskByte);

/* DMA Tx/Rx descriptors */
void ETH_ConfigDmaTxDescInChainMode(ETH_DMADescType* DMATxDescTab, u8* TxBuff, uint32_t BufSize, uint32_t TxBuffCount);
void ETH_ConfigDmaTxDescInRingMode(ETH_DMADescType* DMATxDescTab,
                                   u8* TxBuff1,
                                   u8* TxBuff2,
                                   uint32_t BufSize,
                                   uint32_t TxBuffCount);
FlagStatus ETH_GetDmaTxDescFlagStatus(ETH_DMADescType* DMATxDesc, uint32_t ETH_DMATxDescFlag);
uint32_t ETH_GetDmaTxDescCollisionCount(ETH_DMADescType* DMATxDesc);
void ETH_SetDmaTxDescOwn(ETH_DMADescType* DMATxDesc);
void ETH_EnableDmaTxDescTransmitInt(ETH_DMADescType* DMATxDesc, FunctionalState Cmd);
void ETH_ConfigDmaTxDescFrameSegment(ETH_DMADescType* DMATxDesc, uint32_t DMATxDesc_FrameSegment);
void ETH_ConfigDmaTxDescChecksumInsertion(ETH_DMADescType* DMATxDesc, uint32_t DMATxDesc_Checksum);
void ETH_EnableDmaTxDescCrc(ETH_DMADescType* DMATxDesc, FunctionalState Cmd);
void ETH_EnableDmaTxDescEndOfRing(ETH_DMADescType* DMATxDesc, FunctionalState Cmd);
void ETH_EnableDmaTxDescSecondAddrChained(ETH_DMADescType* DMATxDesc, FunctionalState Cmd);
void ETH_EnableDmaTxDescShortFramePadding(ETH_DMADescType* DMATxDesc, FunctionalState Cmd);
void ETH_EnableDmaTxDescTimeStamp(ETH_DMADescType* DMATxDesc, FunctionalState Cmd);
void ETH_ConfigDmaTxDescBufSize(ETH_DMADescType* DMATxDesc, uint32_t BufferSize1, uint32_t BufferSize2);
void ETH_ConfigDmaRxDescInChainMode(ETH_DMADescType* DMARxDescTab, u8* RxBuff, uint32_t BufSize, uint32_t RxBuffCount);
void ETH_ConfigDmaRxDescInRingMode(ETH_DMADescType* DMARxDescTab,
                                   u8* RxBuff1,
                                   u8* RxBuff2,
                                   uint32_t BuffSize,
                                   uint32_t RxBuffCount);
FlagStatus ETH_GetDmaRxDescFlagStatus(ETH_DMADescType* DMARxDesc, uint32_t ETH_DMARxDescFlag);
void ETH_SetDmaRxDescOwn(ETH_DMADescType* DMARxDesc);
uint32_t ETH_GetDmaRxDescFrameLen(__IO ETH_DMADescType* DMARxDesc);
void ETH_EnableDmaRxDescReceiveInt(ETH_DMADescType* DMARxDesc, FunctionalState Cmd);
void ETH_EnableDmaRxDescEndOfRing(ETH_DMADescType* DMARxDesc, FunctionalState Cmd);
void ETH_EnableDmaRxDescSecondAddrChained(ETH_DMADescType* DMARxDesc, FunctionalState Cmd);
uint32_t ETH_GetDmaRxDescBufSize(ETH_DMADescType* DMARxDesc, uint32_t DMARxDesc_Buffer);

/* DMA */
FlagStatus ETH_GetDmaFlagStatus(uint32_t ETH_DMA_FLAG);
void ETH_ClrDmaFlag(uint32_t ETH_DMA_FLAG);
INTStatus ETH_GetDmaIntStatus(uint32_t ETH_DMA_IT);
void ETH_ClrDmaIntPendingBit(uint32_t ETH_DMA_IT);
uint32_t ETH_GetTxProcState(void);
uint32_t ETH_GetRxProcState(void);
void ETH_FlushTxFifo(void);
FlagStatus ETH_GetFlushTxFifoStatus(void);
void ETH_EnableDmaTx(FunctionalState Cmd);
void ETH_EnableDmaRx(FunctionalState Cmd);
void ETH_EnableDmaInt(uint32_t ETH_DMA_IT, FunctionalState Cmd);
FlagStatus ETH_GetDmaOverflowStatus(uint32_t ETH_DMA_Overflow);
uint32_t ETH_GetRxOverflowMissedFrameCounter(void);
uint32_t ETH_GetBufUnavailableMissedFrameCounter(void);
uint32_t ETH_GetCurrentTxDescAddr(void);
uint32_t ETH_GetCurrentRxDescAddr(void);
uint32_t ETH_GetCurrentTxBufAddr(void);
uint32_t ETH_GetCurrentRxBufAddr(void);
void ETH_ResumeDmaTx(void);
void ETH_ResumeDmaRx(void);

/* PMT */
void ETH_ResetWakeUpFrameFilter(void);
void ETH_SetWakeUpFrameFilter(uint32_t* Buffer);
void ETH_EnableGlobalUnicastWakeUp(FunctionalState Cmd);
FlagStatus ETH_GetPmtFlagStatus(uint32_t ETH_PMT_FLAG);
void ETH_EnableWakeUpFrameDetection(FunctionalState Cmd);
void ETH_EnableMagicPacketDetection(FunctionalState Cmd);
void ETH_EnablePowerDown(FunctionalState Cmd);

/* MMC */
void ETH_EnableMmcCounterFreeze(FunctionalState Cmd);
void ETH_EnableMmcResetOnRead(FunctionalState Cmd);
void ETH_EnableMmcCounterRollover(FunctionalState Cmd);
void ETH_ResetMmcCounters(void);
void ETH_EnableMmcInt(uint32_t ETH_MMC_IT, FunctionalState Cmd);
INTStatus ETH_GetMmcIntStatus(uint32_t ETH_MMC_IT);
uint32_t ETH_GetMmcRegisterValue(uint32_t ETH_MMCReg);

/* PTP */
uint32_t ETH_TxPtpPacket(u8* ppkt, u16 FrameLength, uint32_t* PTPTxTab);
uint32_t ETH_RxPtpPacket(u8* ppkt, uint32_t* PTPRxTab);
void ETH_ConfigDmaPtpTxDescInChainMode(ETH_DMADescType* DMATxDescTab,
                                       ETH_DMADescType* DMAPTPTxDescTab,
                                       u8* TxBuff,
                                       uint32_t TxBuffCount);
void ETH_ConfigDmaPtpRxDescInChainMode(ETH_DMADescType* DMARxDescTab,
                                       ETH_DMADescType* DMAPTPRxDescTab,
                                       u8* RxBuff,
                                       uint32_t RxBuffCount);
void ETH_UpdatePtpTimeStampAddend(void);
void ETH_EnablePtpTimeStampIntTrigger(void);
void ETH_UpdatePtpTimeStamp(void);
void ETH_InitPtpTimeStamp(void);
void ETH_ConfigPtpUpdateMethod(uint32_t UpdateMethod);
void ETH_StartPTPTimeStamp(FunctionalState Cmd);
FlagStatus ETH_GetPtpFlagStatus(uint32_t ETH_PTP_FLAG);
void ETH_SetPtpSubSecondInc(uint32_t SubSecondValue);
void ETH_SetPtpTimeStampUpdate(uint32_t Sign, uint32_t SecondValue, uint32_t SubSecondValue);
void ETH_SetPtpTimeStampAddend(uint32_t Value);
void ETH_SetPtpTargetTime(uint32_t HighValue, uint32_t LowValue);
uint32_t ETH_GetPtpRegisterValue(uint32_t ETH_PTPReg);
/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __N32G45X_ETH_H__ */
/**
 * @}
 */

/**
 * @}
 */
